# Constants for daily checklist items

DAILY_CHECKLIST_ITEMS = [
    {
        'id': '1.1',
        'section': '1. СОБЛЮДЕНИЕ ТРЕБОВАНИЙ БЕЗОПАСНОСТИ ТРУДА. КУЛЬТУРА ПРОИЗВОДСТВА.',
        'text': 'Оформление наряд-допуска на безопасное проведение работ в местах охранной зоны: линий электропередач и прилегающих объектов электроэнергетики; линий связи и прилегающих сооружений связи; прилегающей зоны железной дороги; трубопроводов (газопроводы, нефтепроводы и т.п.); объекта культурного наследия; военного объекта; государственного природного заповедника (включая национальные парки и памятники природы).',
        'normative_doc': '(п. 4.6., п. 4.11., п. 4.11.2., п. 4.11.3., п. 4.11.4. СНиП 12-03-2001 Безопасность труда в строительстве). (Статья 105. «Земельный кодекс РФ от 25.10.2001 №136-ФЗ)'
    },
    {
        'id': '1.2',
        'section': '',
        'text': 'Наличие устойчивого ограждения из секций КГХ с гирляндой фонарей аварийного освещения по периметру зоны работ (со сроком более 2-х дней в пешеходной зоне, более 7 дней в зоне проезжей части). Ширина прохода пешеходов между выгородками КГХ не менее 1,5 м.',
        'normative_doc': '(п. 6.2.2. СНиП 12-03-2001 Безопасность труда в строительстве. ГОСТ Р 58967-2020 Ограждения инвентарные строительных площадок и участков производства СМР. (п. 4.9. СП 48.13330.2019. Организация строительства изм. №2).'
    },
    {
        'id': '1.3',
        'section': '',
        'text': 'Наличие крепких пешеходных деревянных настилов (шириной не менее 1,5 метра) в местах прохода пешеходов по не твёрдым покрытиям и газонам. Наличие пандусов при перепаде высот свыше 10 см на пути следования пешеходов',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.4',
        'section': '',
        'text': 'Ограждения КГХ и водоналивные блоки не имеют загрязнений, повреждений, деформаций, вандальных надписей.',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.5',
        'section': '',
        'text': 'Наличие читаемых навигационных указателей для движения пешеходов при выходе из подземных переходов, метро, разветвлениях и пр.',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.6',
        'section': '',
        'text': 'Наличие временных дорожных знаков, разметки, светофоров, импульсных стрелок и пр. согласно требованиям ПОДД(С) для безопасного движения транспортных средств в зоне работ',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.7',
        'section': '',
        'text': 'В местах заезда техники к участкам производства работ обеспечено необходимость «карманов или воротничков» для безопасного производства работ.',
        'normative_doc': '(НТД..)'
    },
    {
        'id': '1.8',
        'section': '',
        'text': 'Закрытие штроб, траншей крепкими пешеходными деревянными настилами в зоне остановок общественного транспорта (допускается временная засыпка штроб или траншей асфальтобетонной крошкой, щебнем мелкой фракции, заделка бетоном, в отметку верха бортового камня проезжей части).',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.9',
        'section': '',
        'text': 'Проход пешеходов к остановкам общественного транспорта без выхода на проезжую часть',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.10',
        'section': '',
        'text': 'Наличие защитного ограждения зелёных насаждений (деревья защищаются сплошными деревянными щитами высотой 2м не более 0,5м от ствола. Кустарники защищаются деревянными щитами высотой не менее 1 м.)',
        'normative_doc': '(НТД...).'
    },
    {
        'id': '1.11',
        'section': '',
        'text': 'Оголенная корневая система зеленых насаждений укрыта геотекстилем (дорнитом) либо засыпана плодородным грунтом',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.12',
        'section': '',
        'text': 'Ограждения материала, либо строительного мусора (объёмом не более 1 кузова самосвала) согласно п.1.2',
        'normative_doc': '(п. 6.2.9. СНиП 12-03-2001 Безопасность труда в строительстве).'
    },
    {
        'id': '1.13',
        'section': '',
        'text': 'Наличие защитного ограждения сохраняемой облицовки зданий и сооружений (парапеты, стены, цоколи входа/выхода метро, подземных пешеходных переходов, автобусных остановок и т.д.). Ограждение выполняется из фанеры, либо сплошных деревянных щитов',
        'normative_doc': '(п. 6.2.2. СНиП 12-03-2001 Безопасность труда в строительстве. ГОСТ Р 58967-2020 Ограждения инвентарные строительных площадок и участков производства СМР. (п. 4.9. СП 48.13330.2019. Организация строительства изм №1).'
    },
    {
        'id': '1.14',
        'section': '',
        'text': 'Своевременный вывоз строительного мусора (объемом более 1 кузова самосвала), а также демонтируемого оборудования и МАФ',
        'normative_doc': '(НТД…)'
    },
    {
        'id': '1.15',
        'section': '',
        'text': 'Наличие оперативной бригады для содержания ограждения зон производства работ согласно требованиям п. 1.2. Отсутствие бытового мусора в выгородках',
        'normative_doc': '(НТД...)'
    },
    {
        'id': '1.16',
        'section': '',
        'text': 'Складирование материалов в соответствие с требованиями НТД. (п. 6.3. Безопасность труда в строительстве). БОРДЮРНЫЙ КАМЕНЬ. Бордюрный камень складируется на поддоне, в штабелях высотой не более 2-х метрах. Расстояние между штабелями не менее 50 см. Штабель установлен на устойчивом основании, без перекосов. Не допускается соприкосновение бордюрного камня с грунтом. ПОЛИЭТИЛЕНОВЫЕ ТРУБЫ. Полиэтиленовые трубы уложены в штабель, высотой не более 3-х метров на инвентарные подкладки. Соприкосновение с грунтом не допускается. Нижний ряд труб укреплён инвентарными башмаками или концевыми упорами. Штабель с полиэтиленовыми трубами установлен устойчиво, без перекосов. ИНЕРТНЫЕ, СТРОИТЕЛЬНЫЕ МАТЕРИАЛЫ (ПЕСОК, ЩЕБЕНЬ). Материал в удаленной зоне от границ тротуаров, проезжей части. Материал не смешан с другими материалами по неоднородности. Организованы временные ограждения материалов.',
        'normative_doc': ''
    },
    {
        'id': '1.17',
        'section': '',
        'text': 'Обеспечение электробезопасности (отсутствие оголенных проводов, треснутых розеток и т.п.), пожаробезопасности (наличие огнетушителя при сварочных работах) на местах производства работ.',
        'normative_doc': '(п. 6.4., п. 6.5. Безопасность труда в строительстве).'
    },
    {
        'id': '1.18',
        'section': '',
        'text': 'Строительная техника исправна, имеет звуковой сигнал при движении задним ходом.',
        'normative_doc': '(п. 7.2. Безопасность труда в строительстве).'
    },
    {
        'id': '1.19',
        'section': '',
        'text': 'Инструмент для выполнения работ, оснастки, специальные приспособления, троса, леса и прочее для выполнения работ в исправном состоянии.',
        'normative_doc': '(п. 7.4. Безопасность труда в строительстве).'
    },
    {
        'id': '1.20',
        'section': '',
        'text': 'Обеспечение работников средствами СИЗ (минимальный комплект). Для водителя-механизатора: Сигнальный жилет. Для монтажника, разнорабочего, стропальщика: Спецодежда; Спецобувь; Сигнальный жилет; Рукавицы (перчатки с обливом); Каска (при погрузочно-разгрузочных работах; Защитные очки (при работе с УШМ). Для сварщика: Сварочная роба; Спецобувь; Каска-маска; Шлем-косынка; Рукавицы-краги, защитные перчатки; Наколенники.',
        'normative_doc': '(Приказ Минтруда РФ от 29.10.2021 г. №766Н Об утверждении правил обеспечения работников средствами СИЗ и смывающими средствами).'
    },
    {
        'id': '2.1',
        'section': '2 ПРОИЗВОДСТВО РАБОТ ПО УСТРОЙСТВУ БОРДЮРНЫХ КАМНЕЙ.',
        'text': 'Сколы на бордюрных камнях свыше допустимых значений (свыше 10 мм сколы НЕ допускаются)',
        'normative_doc': '(п. 6.5.2. Таблица Б4. Приложение Б. ГОСТ 50597-2017 Дороги автомобильные и улицы ).'
    },
    {
        'id': '2.2',
        'section': '',
        'text': 'Планово-высотное смещение бордюрных камней на стыках не более 5мм',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '2.3',
        'section': '',
        'text': 'Зазоры на стыках бордюрных камней (включая толщину компенсатора) не более 5мм',
        'normative_doc': '(п. 6.5.2. Таблица Б4. Приложение Б. ГОСТ 50597-2017 Дороги автомобильные и улицы ).'
    },
    {
        'id': '2.4',
        'section': '',
        'text': 'При наличии зазоров (до 10 мм) между бордюрными камнями, шов НЕ заполнен бетонным раствором портландцементного класса не ниже В30.',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '2.5',
        'section': '',
        'text': 'Прямолинейная установка бортовых камней',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '2.6',
        'section': '',
        'text': 'Установка бордюрных камней выполнена ВЫШЕ или НИЖЕ уровня профиля газона, асфальтобетонного покрытия, тротуарной плитки. (Допускается до 5 см.)',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '2.7',
        'section': '',
        'text': 'Выступ бортового камня за пределы КДО',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '2.8',
        'section': '',
        'text': 'Применены непроектные элементы (углы, радиусы) бордюрного камня.',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '2.9',
        'section': '',
        'text': 'Уплотнение песчаного основания виброплитой за 3-4 прохода',
        'normative_doc': '(п. 7.13. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.10',
        'section': '',
        'text': 'Размеры бетонной обоймы бортового камня соответствует проектному решению, бетон имеет единое тело на всём сечении. Применяется бетон класса не ниже В15, подвижность смеси П-3…П-4 в зависимости от погодных условий',
        'normative_doc': ''
    },
    {
        'id': '2.11',
        'section': '',
        'text': 'Бетонная обойма бордюрного камня НЕ ИМЕЕТ повреждений. Бетон не крошится после набора прочности',
        'normative_doc': '(п. 6.25. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '3.1',
        'section': '3. БЕТОННЫЕ РАБОТЫ. УСТРОЙСТВО БЕТОННЫХ ДОРОГ.',
        'text': 'Подготовка основания: Плодородный слой удалён полностью (от 10 до 30 см). Укладка геотекстиля (при проектном решении). Песчаное основание имеет толщину 15-30 см. Песчаное основание уплотнено должным образом. Укладка геотекстиля (при проектном решении). Щебеночно-гравийная (крупная фракция) смесь имеет толщину 20-40 см, утрамбована. Щебеночно-гравийная смесь (мелкая фракция) расклинена, утрамбована. Щебеночное основание выравнено мелкой фракцией или бетонной смесью низкого класса прочности. * При наличии канализационных люков, уровень люка должен соответствовать финишному слою бетонного покрытия. Предусмотрена установка дополнительных элементов для увеличения высоты уровня канализационного люка.',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '3.2',
        'section': '',
        'text': 'Монтаж опалубки: Опалубка установлена надёжно, без видимых щелей. На опалубку нанесена водная суспензия (эмульсия) или другой состав для предотвращения прилипания бетона к опалубке. Геометрические параметры опалубки соответствуют проектным решениям. На опалубке отмечены маяки до уровня заливки бетоном. При проектном решении внутрь опалубки укладывается армированный каркас из стержней арматуры 12-16 мм.',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '3.3',
        'section': '',
        'text': 'Бетонирование: Бетонное покрытие толщиной 18-24 см (или согласно проектного решения). После заливки бетонная смесь уплотняется, выравнивается по маякам до заданного уровня. Во время набора прочности (до 50-60%) бетонная поверхность подлежит уходу постоянным увлажнением (поливкой).',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '4.1',
        'section': '4. АСФАЛЬТОБЕТОННЫЕ ДОРОГИ, ТРОТУАРЫ ИЗ АСФАЛЬТОБЕТОННОГО ПОКРЫТИЯ.',
        'text': 'Подготовка основания. Плодородный слой удалён полностью (от 10 до 100 см). Укладка геотекстиля (при проектном решении). Песчаное основание имеет толщину 15-40 см. Песчаное основание уплотнено должным образом. Укладка геотекстиля (при проектном решении). Щебеночно-гравийная (крупная фракция) смесь имеет толщину 20-40 см, утрамбована. Щебеночно-гравийная смесь (мелкая фракция) расклинена, утрамбована. Укладка геосетки/георешетки (при проектном решении). * При наличии канализационных люков, уровень люка должен соответствовать финишного слоя асфальтобетонного покрытия. Предусмотрена установка дополнительных элементов для увеличения высоты уровня канализационного люка.',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '4.2',
        'section': '',
        'text': 'Укладка покрытия. При замене изношенного слоя дорожного полотна методом фрезерования старого асфальтобетонного покрытия для нанесения нового (этап капитального ремонта дорожного полотна), пункт 4.1. НЕ контролируется. Проливка основания битумной эмульсией (не позднее 3-х часов перед укладкой асфальтобетона). Укладка первого слоя асфальтобетонного покрытия. Проверка температуры асфальтобетона из кузова в асфальтоукладчик 120-160 град. Проход легкого катка не менее 5-ти раз по одному месту. Асфальт считается уплотненным при отсутствии волны перед катком. Температура уплотняемого асфальтобетона должна составлять в пределах 80-120 град. Укладка второго слоя асфальтобетонного покрытия. Проверка температуры асфальтобетона из кузова в асфальтоукладчик 120-160 град. Проход легкого катка не менее 5-ти раз по одному месту. Асфальт считается уплотненным при отсутствии волны перед катком. Температура уплотняемого асфальтобетона должна составлять в пределах 80-120 град. Бесшовность и разнородность уложенных асфальтобетонных смесей отсутствует. Деформационные швы (при наличии) в асфальтобетонном покрытии отсутствуют. При уплотнении асфальтобетонного покрытия достигнут коэффициент уплотнения не ниже 0,93. Взяты отборы кернов для проведения испытаний: 1 керн с площади не более 2000 м2. (Запросить данные у лаборатории подрядчика).',
        'normative_doc': '(Проектное решение. п. 6.12. СП 82.13330.2016 Благоустройство территорий).'
    },
    {
        'id': '5.1',
        'section': '5. УСТРОЙСТВО ТРОТУАРА ИЗ ТРОТУАРНОЙ ПЛИТКИ.',
        'text': 'Подготовка основания: Плодородный слой удалён полностью (от 0 до 30 см). Укладка геотекстиля (при проектном решении). Песчаное основание имеет проектную толщину Песчаное основание уплотнено должным образом. * При наличии канализационных люков, уровень люка должен соответствовать уровню тротуарной плитки. Предусмотрена установка дополнительных элементов для увеличения высоты уровня канализационного люка.',
        'normative_doc': '(Проектное решение).'
    },
    {
        'id': '5.2',
        'section': '',
        'text': 'Укладка плитки: Высотно-плановые перепады в стыках плитки не более 5 мм Швы между тротуарными плитками не более 5 мм. Шов заполнен герметизирующим материалом.',
        'normative_doc': '(п. 6.22. СП 82.13330.2016 Благоустройство территорий).'
    }
]

# Status choices for checklist items
CHECKLIST_ITEM_STATUSES = [
    ('yes', 'ДА'),
    ('no', 'НЕТ'),
    ('not_required', 'Не требуется'),
]

# Constants for opening checklist items (Форма №1)
OPENING_CHECKLIST_ITEMS = [
    {
        'id': '1.1',
        'section': '1. НАЛИЧИЕ РАЗРЕШИТЕЛЬНОЙ, ОРГАНИЗАЦИОННО-ТЕХНОЛОГИЧЕСКОЙ, РАБОЧЕЙ ДОКУМЕНТАЦИИ.',
        'text': 'Наличие приказа на ответственное лицо, осуществляющего строительство (производство работ).',
        'normative_doc': '(п. 5.3. СП 48.13330.2019. Изм. №1. Организация строительства)'
    },
    {
        'id': '1.2',
        'section': '',
        'text': 'Наличие приказа на ответственное лицо, осуществляющее строительный контроль (с указанием идентификационного номера в НРС в области строительства).',
        'normative_doc': '(п. 5.3. СП 48.13330.2019. Изм. №1. Организация строительства)'
    },
    {
        'id': '1.3',
        'section': '',
        'text': 'Наличие приказа на ответственное лицо, осуществляющее подготовку проектной документации, авторский надзор',
        'normative_doc': '(п. 5.3. СП 48.13330.2019. Изм. №1. Организация строительства)'
    },
    {
        'id': '1.4',
        'section': '',
        'text': 'Наличие проектной документации со штампом «В производство работ»',
        'normative_doc': '(п. 5.5. СП 48.13330.2019. Изм. №1. Организация строительства)'
    },
    {
        'id': '1.5',
        'section': '',
        'text': 'Наличие проекта производства работ (утвержденного руководителем подрядной организации, согласованного Заказчиком, проектировщиком, эксплуатирующей организацией).',
        'normative_doc': '(п. 6.4., п. 6.7., п. 6.9. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.1',
        'section': '2. ИНЖЕНЕРНАЯ ПОДГОТОВКА СТРОИТЕЛЬНОЙ ПЛОЩАДКИ.',
        'text': 'Наличие акта геодезической разбивочной основы, принятых знаков (реперов).',
        'normative_doc': '(п. 7.2. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.2',
        'section': '',
        'text': 'Наличие генерального плана (ситуационного плана).',
        'normative_doc': '(п. 7.6. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.3',
        'section': '',
        'text': 'Фактическое размещение временной инженерной и бытовой инфраструктуры площадки (включая стоянку автотранспорта) согласно проекту организации. Соответствие размещённых временных инфраструктуры требованиям электробезопасности, пожарных, санитарно-эпидемиологических норм и правил.',
        'normative_doc': '(п. 7.10., п. 7.34. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.4',
        'section': '',
        'text': 'Наличие пунктов очистки или мойки колес транспортных средств на выездах со строительной площадки.',
        'normative_doc': '(п. 7.13. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.5',
        'section': '',
        'text': 'Наличие бункеров или контейнеров для сбора отдельно бытового и отдельно строительного мусора.',
        'normative_doc': '(п. 7.13. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.6',
        'section': '',
        'text': 'Наличие информационных щитов (знаков) с указанием: - наименование объекта; - наименование Застройщика (технического Заказчика); - наименование подрядной организации; - наименование проектной организации; - сроки строительства; - контактные телефоны ответственных по приказу лиц по организации.',
        'normative_doc': '(п. 7.13. СП 48.13330.2019. Изм. №1. Организация строительства).'
    },
    {
        'id': '2.7',
        'section': '',
        'text': 'Наличие стендов пожарной безопасности с указанием на схеме мест источников воды, средств пожаротушения.',
        'normative_doc': '(п. 7.13. СП 48.13330.2019. Изм. №1. Организация строительства).'
    }
]